[
  {
   
  "title": "Sikkim",
  "year": "1970",
  "description": "Sikkim is a visually stunning documentary that explores the beauty, culture, and traditions of the then-kingdom of Sikkim. Commissioned by the Chogyal (king) and his American wife, the film showcases majestic landscapes, monastic rituals, and the harmonious coexistence of people and nature. Ray's poetic narration and immersive cinematography capture the essence of a secluded Himalayan state on the brink of change. Though banned for decades due to political sensitivities, it stands as a rare and elegant portrait of a lost era.",


    "posterUrl": "https://i.imgur.com/Bp0ExcH.jpeg",
    "imdbUrl": "https://www.imdb.com/title/tt0067754/",
    "youtubeUrl": "https://www.youtube.com/watch?v=yFgJtCMrulM",
    "downloadUrl": "https://archive.org/details/Ray-filmography/Sikkim+(1971).mp4"
    
  },
  {
    "title": "Rabindranath Tagore",
"year": "1961",
"description": "Rabindranath Tagore is a respectful and insightful tribute to the Nobel Laureate poet, philosopher, and polymath. Made on the occasion of Tagore’s birth centenary, the documentary traces his life from childhood to his final years, highlighting his literary achievements, contributions to education, and global influence. With archival photographs, dramatized sequences, and a solemn tone, Ray portrays Tagore not just as a national icon, but as a universal thinker who reshaped Bengali and world literature.",

    
    "posterUrl": "https://i.imgur.com/5yVu0JL.jpeg",
    "imdbUrl": "https://www.imdb.com/title/tt0055351/",
    "youtubeUrl": "https://youtu.be/pQVFJYGXiv0?si=88xAXXy5AZVR8pKV",
    "downloadUrl": "https://archive.org/details/Ray-filmography/RABINDRANATH+TAGORE+(1961).MP4"
    
  },
  {
    "title": "The Inner Eye",
"year": "1971",
"description": "The Inner Eye is a deeply moving documentary on Benode Behari Mukherjee, a pioneering Indian modern artist who continued to create even after losing his eyesight. Ray presents Mukherjee’s artistic journey with empathy and admiration, blending visuals of his murals with reflections on perception, memory, and resilience. The film becomes a meditation on the power of inner vision and the unyielding spirit of creativity, celebrating the artist’s unique way of seeing the world beyond physical sight.",

    "posterUrl": "https://i.imgur.com/l3LHlUi.jpeg",
    "imdbUrl": "https://www.imdb.com/title/tt0068741/",
    "youtubeUrl": "https://youtu.be/TeAhVXZ6pUk?si=hWgKbzrRiM6ssiZc",
    "downloadUrl": "https://archive.org/details/Ray-filmography/The+Inner+Eye-SatyajitRoy.wmv"
    
  },
  {
    "title": "Sukumar Ray",
"year": "1984",
"description": "Sukumar Ray is a personal and affectionate documentary made by Satyajit Ray about his father, the celebrated Bengali writer, poet, and illustrator known for his nonsense literature and children's classics. Through rare photographs, family anecdotes, and readings from Sukumar Ray’s iconic works like 'Abol Tabol' and 'HaJaBaRaLa', the film captures his wit, creativity, and influence on Bengali literature. As a tribute from a son to his father, it’s filled with warmth, nostalgia, and literary admiration.",

    "posterUrl": "https://i.imgur.com/YTCmsFV.jpeg",
    "imdbUrl": "https://www.imdb.com/title/tt0094069/",
    "youtubeUrl": "https://youtu.be/kRg1WbFvXqo?si=2F2UiqoBZz_c5oGu",
    "downloadUrl": "https://archive.org/details/Ray-filmography/SUKUMAR+RAY+(1987).mp4"
    
    
  },
  {
   "title": "Bala",
"year": "1976",
"description": "Bala is a graceful documentary that pays homage to Balasaraswati, the legendary Bharatanatyam dancer who brought the classical dance form to international recognition. Satyajit Ray captures her artistry through rehearsals, performances, and commentary, emphasizing her deep emotional expression and mastery of rhythm. The film serves not only as a tribute to an iconic artist but also as a preservation of a rich cultural tradition, offering viewers an intimate glimpse into the soul of Indian classical dance.",

    "posterUrl": "https://i.imgur.com/EzbbzKH.jpeg",
    "imdbUrl": "https://www.imdb.com/title/tt0074177/",
    "youtubeUrl": "https://youtu.be/ak_a1RJ2DZc?si=EzI_U-QPPf3J5euR",
    "downloadUrl": "https://archive.org/details/Ray-filmography/Bala+(1976).MP4"
    
  },
  {
    "title": "Two",
"year": "1964",
"description": "Two is a short, silent film by Satyajit Ray that explores the clash between wealth and poverty through the innocent rivalry of two children. Set in a modern urban household, a rich boy with mechanical toys watches a poor street child playing with handmade ones. What begins as playful competition subtly turns into a reflection on class divide, materialism, and empathy. Without a single word, Ray crafts a powerful visual commentary on human behavior and societal inequality.",

    
    "posterUrl": "https://i.imgur.com/nXjt9fH.jpeg",
    "imdbUrl": "https://www.imdb.com/title/tt0053765/?ref_=fn_all_ttl_5",
    "youtubeUrl": "https://youtu.be/zACGLjd9JNY?si=19Pi-YoB-sVeLe6t",
    "downloadUrl": "https://archive.org/details/Ray-filmography/Two+(1964).MP4"
  }
  
]