[
  {
    "title": "ফেলুদার গোয়েন্দাগিরি",
    "year": "1965-66",
    "cover_image": "https://i.imgur.com/1tVCb5i.jpeg",
    "synopsis": "Feluda, a sharp young man, makes his debut as a detective. While vacationing in Darjeeling, he gets involved in a mysterious case. The plot revolves around a theft and some suspicious characters. Using his intelligence and observation skills, Feluda solves the mystery.",

    "read_more": "https://www.goodreads.com/book/show/23518116.Feluda_r_Goendagiri"
  },
  {
    "title": "বাদশাহী আংটি",
    "year": "1965-66",
    "cover_image": "https://i.imgur.com/LxoPqQV.jpeg",
    "synopsis": "Feluda is hired to investigate the authenticity of a Mughal emperor’s ring. The quest takes him to Lucknow, where he encounters historians, collectors, and a cunning villain. As layers of deception unfold, Feluda must protect the priceless artifact. His wit and bravery lead to an exciting conclusion.",


    "read_more": "https://www.goodreads.com/book/show/17902092?from_search=true&from_srp=true&qid=xYUXx2n8aJ&rank=1"
  },
  {
    "title": "কৈলাস চৌধুরীর পাথর",
    "year": "1967",
    "cover_image": "https://i.imgur.com/FxLwUxS.jpeg",
    "synopsis": "Feluda is called to investigate the theft of a mysterious stone owned by Kailash Chowdhury. The case leads him through a web of hidden motives and family secrets. With Topshe and Jatayu, he uncovers the surprising truth. The story highlights Feluda’s sharp reasoning and deductive skills."
,
    "read_more": "https://www.goodreads.com/book/show/23518158?from_search=true&from_srp=true&qid=X1zcGA68uK&rank=1"
  },
   {
    "title": "শেয়াল দেবতা রহস্য",
    "year": "1970",
    "cover_image": "https://i.imgur.com/5JRO7QK.jpeg",
  "synopsis": "Feluda travels to Hazaribagh to solve a mystery involving an ancient idol of the jackal-headed Egyptian god Anubis. A suspicious death and secret messages deepen the intrigue. As Feluda investigates, he uncovers a hidden treasure and a dangerous adversary. His clever deductions lead to a thrilling climax.",

    "read_more": "https://www.goodreads.com/book/show/23522431?ref=nav_sb_ss_1_18"
  },
  {
    "title": "গ্যাংটকে গণ্ডগোল",
    "year": "1970",
    "cover_image": "https://i.imgur.com/oQhfu3Y.jpeg",
   "synopsis": "Feluda visits Gangtok with Topshe and Jatayu for a holiday, but soon gets involved in a mysterious case. A wealthy businessman is being blackmailed over a secret from his past. With danger looming and suspects around, Feluda digs deeper. His investigation reveals a shocking truth and ensures justice."
,
    "read_more": "https://www.goodreads.com/book/show/20956873?ref=nav_sb_ss_1_16"
  },
  {
    "title": "সোনার কেল্লা",
    "year": "1971",
    "cover_image": "https://i.imgur.com/hUOPWmB.jpeg",
    "synopsis": "A young boy named Mukul claims to remember a past life and a golden fortress. Feluda is hired to protect him and investigate his visions. The journey leads them across Rajasthan, with criminals chasing them for hidden treasure. Feluda’s brilliance helps solve the mystery of the 'Sonar Kella'."
,
    "read_more": "https://www.goodreads.com/book/show/20956687?from_search=true&from_srp=true&qid=pYRZqL3xTW&rank=1"
  },
   {
    "title": "বাক্স রহস্য",
    "year": "1972",
    "cover_image": "https://i.imgur.com/vqlMVz3.jpeg",
    "synopsis": "Feluda boards the Kalka Mail to investigate a strange case involving a mysterious trunk. A wealthy man's sudden disappearance adds to the suspense. Clues hidden in conversations and compartments guide Feluda through the puzzle. His sharp mind unravels the truth behind the box and the vanishing act.",
    "read_more": "https://www.goodreads.com/book/show/12664136--?ref=nav_sb_ss_1_11"
  },
  {
    "title": "কৈলাসে কেলেঙ্কারি",
    "year": "1973",
    "cover_image": "https://i.imgur.com/plJja3K.jpeg",
    "synopsis": "Feluda boards the Kalka Mail to investigate a strange case involving a mysterious trunk. A wealthy man's sudden disappearance adds to the suspense. Clues hidden in conversations and compartments guide Feluda through the puzzle. His sharp mind unravels the truth behind the box and the vanishing act.",
    "read_more": "https://www.goodreads.com/book/show/20956661?ref=nav_sb_ss_1_17"
  },
  {
    "title": "সমাদ্দারের চাবি",
    "year": "1973",
    "cover_image": "https://i.imgur.com/TxH7gHD.jpeg",
    "synopsis": "Feluda is asked to find a missing key that belonged to the late scientist Shyamlal Somadder. The key is said to unlock a hidden secret of great importance. As Feluda investigates, he encounters cryptic clues and potential dangers. The case ends with an unexpected revelation tied to science and greed.",
    "read_more": "https://www.goodreads.com/book/show/23522438?ref=nav_sb_ss_1_15"
  },
   {
    "title": "রয়্যাল বেঙ্গল রহস্য",
    "year": "1974",
    "cover_image": "https://i.imgur.com/OBTlWma.jpeg",
    "synopsis": "Feluda travels to the forests of Dooars with Topshe and Jatayu to meet a wealthy timber merchant. Soon, a mysterious attempt on the merchant’s life sparks an investigation. Amid tiger sightings and jungle treks, hidden motives emerge. Feluda’s sharp instincts uncover the truth behind the Royal Bengal mystery.",
    "read_more": "https://www.goodreads.com/book/show/40095732"
  },
  {
    "title": "ঘুরঘুটিয়ার ঘটনা",
    "year": "1975",
    "cover_image": "https://i.imgur.com/lh6N6ig.jpeg",
    "synopsis": "Feluda is invited to Ghurni, Krishnanagar, to solve a puzzling case involving a mysterious death. The victim’s strange behavior and a hidden will raise suspicion. As Feluda explores the eerie surroundings and quirky characters, secrets begin to surface. His keen logic uncovers the truth behind the Ghurghutia incident.",
    "read_more": "https://www.goodreads.com/book/show/23522443?ref=nav_sb_ss_1_16"
  },
  {
    "title": "জয় বাবা ফেলুনাথ",
    "year": "1975",
    "cover_image": "https://i.imgur.com/jy80eU2.jpeg",
    "synopsis": "Feluda visits Varanasi with Topshe and Jatayu during the Durga Puja holidays. A valuable antique idol is stolen from a devout collector. Feluda suspects a powerful and dangerous villain named Maganlal Meghraj. With intelligence and bravery, he retrieves the idol and brings the culprit to justice.",
    "read_more": "https://www.goodreads.com/book/show/12664174?ref=nav_sb_ss_1_16"
  },
   {
    "title": "বোম্বাইয়ের বোম্বেটে",
    "year": "1976",
    "cover_image": "https://i.imgur.com/K77DFgE.jpeg",
    "synopsis": "Feluda, Topshe, and Jatayu travel to Bombay to investigate the mysterious death of a businessman. A missing will, greedy relatives, and underworld connections make the case complex. Feluda navigates the city's glitz and danger to uncover the truth. His sharp mind solves the mystery amidst Bombay’s chaos.",
    "read_more": "https://www.goodreads.com/book/show/23453978?ref=nav_sb_ss_1_20"
  },
  {
    "title": "গোসাঁইপুর সরগরম",
    "year": "1976",
    "cover_image": "https://i.imgur.com/h9LjgBf.jpeg",
    "synopsis": "Feluda is invited to the village of Gosaipur to solve a mystery involving a wealthy zamindar family. A threat against the old zamindar and strange happenings keep everyone on edge. Family secrets and deception cloud the truth. Feluda’s investigation brings clarity and justice to the household.",
    "read_more": "https://www.goodreads.com/book/show/34319242?from_search=true&from_srp=true&qid=u3b25Pq6kz&rank=1"
  },
  {
    "title": "গোরস্থানে সাবধান",
    "year": "1977",
    "cover_image": "https://i.imgur.com/K5q1W1Y.jpeg",
    "synopsis": "Feluda investigates strange occurrences near a graveyard where people have reported eerie incidents. A suspicious death and hidden motives raise questions. With Topshe and Jatayu’s help, Feluda uncovers a criminal plot. His sharp detective skills bring the truth to light and restore peace.",
    "read_more": "https://www.goodreads.com/book/show/23454002?ref=nav_sb_ss_1_16"
  },
   {
    "title": "ছিন্নমস্তার অভিশাপ",
    "year": "1978",
    "cover_image": "https://i.imgur.com/P2sQk0z.jpeg",
    "synopsis": "Feluda is called to a remote village where the legend of the Chinnamasta’s curse haunts the locals. Strange accidents and mysterious deaths spark fear. Feluda investigates the truth behind the superstition, uncovering human greed and deception. His logic dispels the myth and solves the case.",
    "read_more": "https://www.goodreads.com/book/show/23454010?ref=nav_sb_ss_1_18"
  },
  {
    "title": "হত্যাপুরী",
    "year": "1979",
    "cover_image": "https://i.imgur.com/CLPEzV0.jpeg",
    "synopsis": "Feluda visits a small town named Hatya Puri to protect a valuable artifact. Soon, a mysterious murder shakes the peaceful town. Feluda uncovers a web of deceit, hidden rivalries, and greed. Using his keen observation and reasoning, he solves the case and restores order.",
    "read_more": "https://www.goodreads.com/book/show/17904378?ref=nav_sb_ss_1_9"
  },
  {
    "title": "গোলকধাম রহস্য",
    "year": "1980",
    "cover_image": "https://i.imgur.com/Tqide3S.jpeg",
    "synopsis": "Feluda is invited to Golakdham, a spiritual retreat, where mysterious thefts and strange happenings occur. The peaceful atmosphere is disturbed by hidden tensions among the residents. Feluda investigates to reveal the culprit behind the disruptions. His sharp intellect uncovers secrets and solves the mystery.",
    "read_more": "https://www.goodreads.com/book/show/23522447?ref=nav_sb_ss_1_13"
  },
   {
    "title": "যত কাণ্ড কাঠমান্ডুতে",
    "year": "1980",
    "cover_image": "https://i.imgur.com/rJ0FO7j.png",
    "synopsis": "Feluda travels to Kathmandu on a holiday that turns adventurous when he encounters a series of strange incidents. A valuable manuscript is stolen, and suspicion falls on various people. Amidst the ancient city’s charm, Feluda unravels a complex plot involving art theft and deception. His clever deductions restore peace and justice.",
    "read_more": "https://www.goodreads.com/book/show/17902103?from_search=true&from_srp=true&qid=8Te9XBLzb7&rank=1"
  },
  {
    "title": "নেপোলিয়নের চিঠি",
    "year": "1981",
    "cover_image": "https://i.imgur.com/1J7pEMF.jpeg",
    "synopsis": "Feluda is drawn into a mystery involving a lost letter written by Napoleon. The letter’s rumored secret sparks a hunt among collectors and historians. Feluda navigates through deceit and danger to uncover the truth. His sharp mind reveals the real story behind the Napoleon’s letter."
,
    "read_more": "https://www.goodreads.com/book/show/23518144?from_search=true&from_srp=true&qid=G4qI2AAOWD&rank=1"
  },
  {
    "title": "টিনটোরেটোর যীশু",
    "year": "1982",
    "cover_image": "https://i.imgur.com/iEnz51o.jpeg",
    "synopsis": "Feluda investigates a rare painting by Tintoretto, rumored to hold a hidden secret related to Jesus. The artwork attracts art lovers and criminals alike. Amidst theft attempts and mystery, Feluda uncovers the truth behind the painting’s value and symbolism. His keen observation solves the case."
,
    "read_more": "https://www.goodreads.com/book/show/17902118?ref=nav_sb_ss_1_15"
  },
   {
    "title": "অম্বর সেন অন্তর্ধান রহস্য",
    "year": "1983",
    "cover_image": "https://i.imgur.com/6jNe8Sq.jpeg",
    "synopsis": "Feluda is hired to find the missing Ambor Sen, a famous scientist who disappeared mysteriously. The investigation uncovers hidden clues and suspicious characters. Feluda’s sharp intellect leads him through twists and turns to solve the disappearance. The truth reveals a conspiracy involving science and power."
,
    "read_more": "https://www.goodreads.com/book/show/42592770?ref=nav_sb_ss_1_25"
  },
  {
    "title": "জাহাঙ্গীরের স্বর্ণমুদ্রা",
    "year": "1983",
    "cover_image": "https://i.imgur.com/k4ECaTJ.jpeg",
    "synopsis": "Feluda is tasked with investigating the theft of a rare gold coin from Emperor Jahangir’s era. The case involves historians, collectors, and a cunning thief. Through careful clues and clever deductions, Feluda uncovers the true culprit. The story highlights his expertise in solving historical mysteries."
,
    "read_more": "https://www.goodreads.com/book/show/21949545?ref=nav_sb_ss_1_24"
  },
  {
    "title": "এবার কাণ্ড কেদারনাথে",
    "year": "1984",
    "cover_image": "https://i.imgur.com/ee4Qet1.jpeg",
    "synopsis": "Feluda visits Kedarnath for a pilgrimage but soon gets involved in a mysterious case. A sacred relic goes missing amidst the chaos of the temple town. With danger lurking, Feluda uses his sharp mind to uncover a conspiracy. His bravery and intellect restore peace and solve the mystery."
,
    "read_more": "https://www.goodreads.com/book/show/20956677?ref=nav_sb_ss_1_20"
  },
   {
    "title": "বসেপুকুরে খুনখারাপি",
    "year": "1985",
    "cover_image": "https://i.imgur.com/TzS4mbu.jpeg",
    "synopsis": "Feluda is called to Bosepukur to investigate a series of violent incidents and mysterious murders. The peaceful village is shaken by suspicion and fear. Feluda’s sharp observation reveals hidden rivalries and dark secrets. His deduction brings the criminals to justice and restores calm."
,
    "read_more": "https://www.rokomari.com/book/73044/bospukure-khunkharapi-feluda-series-10"
  },
  {
    "title": "দার্জিলিং জমজমাট",
    "year": "1986",
    "cover_image": "https://i.imgur.com/lMhMNe0.jpeg",
   "synopsis": "Feluda visits Darjeeling and finds himself in the middle of a lively mystery involving a stolen artifact. Amidst the bustling hill station, he encounters suspicious characters and hidden motives. With Topshe and Jatayu, Feluda unravels the complex web of deceit. His keen intellect solves the case, restoring peace."
,
    "read_more": "https://www.goodreads.com/bn/book/show/17904238"
  },
  {
    "title": "ইন্দ্রজাল রহস্য",
    "year": "1987",
    "cover_image": "https://i.imgur.com/sj23TSc.jpeg",
    "synopsis": "Feluda is called to investigate a baffling mystery involving magical illusions and disappearances. Strange events around a magician’s show spark suspicion. Feluda uses logic and observation to separate fact from trickery. His sharp mind uncovers the truth behind the Indrajal mystery."
,
    "read_more": "https://www.goodreads.com/book/show/23570457?from_search=true&from_srp=true&qid=FlgT2SudFf&rank=1"
  },
   {
    "title": "অপ্সরা থিয়েটারের মামলা",
    "year": "1987",
    "cover_image": "https://i.imgur.com/MJCWpQS.jpeg",
    "synopsis": "Feluda visits the Apsara Theatre to solve a case involving a missing actor and strange happenings backstage. Suspense builds as secrets from the theatre’s past come to light. Feluda’s keen observation and reasoning unravel the mystery. Justice is served amidst the glamour and drama."
,
    "read_more": "https://www.goodreads.com/book/show/23522468?from_search=true&from_srp=true&qid=nYlyljYeMu&rank=1"
  },
  {
    "title": "ভূস্বর্গে ভয়ঙ্কর",
    "year": "1987",
    "cover_image": "https://i.imgur.com/fEiE0Ck.jpeg",
    "synopsis": "Feluda visits Bhuswarga, a remote forest area, where mysterious accidents and eerie incidents frighten the locals. A hidden criminal plot threatens the peace of the region. Using his sharp intellect, Feluda uncovers the truth behind the terrifying events. His courage and logic restore safety and order."
,
    "read_more": "https://www.goodreads.com/book/show/23522487?ref=rae_10"
  },
  {
    "title": "শকুন্তলার কণ্ঠহার",
    "year": "1988",
    "cover_image": "https://i.imgur.com/I6VjMB6.jpeg",
    "synopsis": "Feluda is drawn into a mystery surrounding Shakuntala, who has mysteriously lost her voice. The investigation uncovers secrets related to jealousy and hidden motives. Feluda’s sharp detective skills help unravel the truth behind the strange silence. Justice and peace are restored by his clever deductions."
,
    "read_more": "https://www.goodreads.com/book/show/23522490?from_search=true&from_srp=true&qid=8F3b30tsXw&rank=1"
  },
   {
    "title": "লন্ডনে ফেলুদা",
    "year": "1989",
    "cover_image": "https://i.imgur.com/ppPzS8p.jpeg",
   "synopsis": "Feluda travels to London on a case involving a stolen diamond with historical significance. Amidst the city’s iconic landmarks, he encounters a web of deceit and danger. Feluda’s sharp intellect and keen observation unravel the mystery. The story ends with the recovery of the precious gem and justice served."
,
    "read_more": "https://www.goodreads.com/book/show/23570407?ref=nav_sb_ss_1_13"
  },
  {
    "title": "গোলাপি মুক্তা রহস্য",
    "year": "1989",
    "cover_image": "https://i.imgur.com/5fducyA.jpeg",
    "synopsis": "Feluda investigates the theft of a rare pink pearl known as the 'Golapi Mukta.' The case involves wealthy collectors and secret dealings. Amidst twists and hidden agendas, Feluda uses his keen observation to uncover the truth. The mystery ends with the pearl safely recovered and the culprit caught."
,
    "read_more": "https://www.goodreads.com/book/show/23570437"
  },
  {
    "title": "ড. মুনশির ডায়েরি",
    "year": "1990",
    "cover_image": "https://i.imgur.com/qiw829O.jpeg",
    "synopsis": "Feluda comes across the mysterious diary of Dr. Munshi, which hints at a hidden treasure. The diary’s cryptic entries lead Feluda on a thrilling chase. Alongside Topshe, he deciphers clues and faces danger. The investigation uncovers secrets long buried and solves the mystery."
,
    "read_more": "https://www.goodreads.com/bn/book/show/23570419"
  },
  {
    "title": "নয়ন রহস্য",
    "year": "1990",
    "cover_image": "https://i.imgur.com/0pgJjLR.jpeg",
    "synopsis": "Feluda is called to solve the mystery surrounding Nayan, a woman caught in a web of deception and danger. Strange events and hidden motives surround her disappearance. Feluda uses his sharp wit to unravel the truth. His investigation leads to justice and reveals the real story behind Nayan."
,
    "read_more": "https://www.goodreads.com/book/show/17904409?ref=nav_sb_ss_1_10"
  },
  {
    "title": "রবার্টসনের রুবি",
    "year": "1992",
    "cover_image": "https://i.imgur.com/UEulpPe.jpeg",
    "synopsis": "Feluda is entrusted with protecting a priceless ruby belonging to Robertson. The gem attracts thieves and dangerous criminals. Amidst attempts to steal the ruby, Feluda’s sharp intellect and bravery help safeguard it. His clever deductions uncover the mastermind behind the plot."
,
    "read_more": "https://www.goodreads.com/book/show/6046161?from_search=true&from_srp=true&qid=qG1mdD4eCj&rank=1"
  }
  
  
]
