[
  {
    "title": "The Collected Short Stories",
    "year": "2001",
    "cover_image": "https://i.imgur.com/l2KILUl.jpeg",
    "synopsis": "A comprehensive anthology of Satyajit Ray’s short stories, compiled and published by Penguin. This collection brings together his finest tales spanning mystery, suspense, and human drama, offering readers a deep insight into Ray’s literary genius.",
    "read_more": "https://dn790006.ca.archive.org/0/items/the-school-for-good-and-evil-books/The%20Collected%20Short%20Stories%20by%20Ray%2C%20Satyajit.pdf"
  },
  {
    "title": "Sera Satyajit",
    "year": "1998",
    "cover_image": "https://i.imgur.com/pWnH4JX.jpeg",
    "synopsis": "A curated collection of some of the best short stories by Satyajit Ray, showcasing his range from mystery and suspense to humor and social commentary. The anthology includes celebrated stories like 'Chhad' and 'Prajapati', reflecting Ray’s mastery in storytelling.",
    "read_more": "https://www.amazon.in/Sera-Satyajit-Ray/dp/8172150318"
  },
  {
    "title": "Ek Dozon Gappo (এক ডজন গল্প)",
    "year": "1986",
    "cover_image": "https://i.imgur.com/zY41teM.jpeg",
    "synopsis": "A collection of twelve short stories by Satyajit Ray, covering a wide range of themes from mystery, humor, supernatural to human emotions. Each story offers Ray's signature storytelling, wit, and keen observation of human nature.",
    "read_more": "https://www.goodreads.com/book/show/6349765"
  },
  {
    "title": "Aro Ek Dozon (আরও এক ডজন)",
    "year": "1987",
    "cover_image": "https://i.imgur.com/mCb6DWn.jpeg",
    "synopsis": "A collection of twelve more short stories by Satyajit Ray. The stories explore a variety of genres, including suspense, humor, the supernatural, and psychological drama, showcasing Ray's versatility and deep understanding of human nature.",
    "read_more": "https://www.goodreads.com/book/show/17671675"
  },
  {
    "title": "Aro Baro (আরও বারো)",
    "year": "1980",
    "cover_image": "https://i.imgur.com/2cAnaZp.jpeg",
    "synopsis": "A collection of twelve captivating short stories by Satyajit Ray. The book includes memorable tales like 'Khagam' and 'Fatikchand', blending mystery, suspense, and psychological depth with Ray’s signature storytelling brilliance.",
    "read_more": "https://www.goodreads.com/book/show/17671662"
  },
  {
    "title": "Ebaro Baro (এবারও বারো)",
    "year": "1993",
    "cover_image": "https://i.imgur.com/SPnmYIn.jpeg",
    "synopsis": "This collection of twelve engaging short stories by Satyajit Ray continues his tradition of blending mystery, humor, and human emotions. Stories like 'Bhoot Bhobishyot' and 'Picnic' showcase Ray’s ability to craft intriguing narratives with unexpected twists.",
    "read_more": "https://www.amazon.in/Abaro-Baro-Satyajit-Ray/dp/8170668638"
  },
  {
    "title": "Bah! Baro (বাহ! বারো)",
    "year": "1991",
    "cover_image": "https://i.imgur.com/Menbmkn.jpegg",
    "synopsis": "A compelling collection of twelve short stories by Satyajit Ray, featuring a mix of suspense, wit, and human insight. Notable stories such as 'Bah! Baro' and 'Tiktiki' highlight Ray’s mastery in creating captivating and thought-provoking tales.",
    "read_more": "https://www.goodreads.com/book/show/2768768"
  },
  {
    "title": "Eker Pithe Dui (এক এর পিঠে দুই)",
    "year": "1974",
    "cover_image": "https://i.imgur.com/MYdfe3S.jpeg",
    "synopsis": "A collection of short stories by Satyajit Ray that explore various facets of human nature and society. Stories like 'Eker Pithe Dui' and 'Nondito Noroke' are marked by Ray’s subtle humor and keen observation of everyday life.",
    "read_more": "https://www.goodreads.com/book/show/165222097-eker-pithe-dui?ref=nav_sb_ss_1_14"
  },
  {
    "title": "Jabor Baro (জবর বারো)",
    "year": "1997",
    "cover_image": "https://i.imgur.com/NAQGrNh.jpeg",
    "synopsis": "A collection of twelve intriguing short stories by Satyajit Ray, weaving together elements of mystery, suspense, and human drama. Noteworthy stories such as 'Jabor Baro' and 'Chhaya Manush' exemplify Ray’s storytelling finesse and deep psychological insight.",
    "read_more": "https://www.amazon.com/Jabar-Baro-Satyajit-Ray/dp/8172155786"
  }
]
